InformationRegisters/ФизическиеЛицаБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаБронированияКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныОтправкиСотрудниковБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправляется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУдачнойОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНеудачнойОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияФизическихЛицБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияФизическихЛицБронированияКомандировок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФизическиеЛицаБронированияКомандировок/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ПрежнийНабор", РегистрыБЗК.ЗаписиНабораИзБазыДанных(ЭтотОбъект, Замещение));
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = ДополнительныеСвойства.ПрежнийНабор;
	Изменения = РегистрыБЗК.ИзменениеЗаписейНабора(ПрежнийНабор, ЭтотОбъект, Замещение, Истина);
	Для Каждого СтрокаТаблицы Из Изменения Цикл
		Если Количество() = 0 Тогда
			Если СтрокаТаблицы.Отправляется Тогда
				РегистрыСведений.ИзмененияФизическихЛицБронированияКомандировок.ЗарегистрироватьСотрудниковВСпискеОтправки(
					СтрокаТаблицы.СистемаБронирования, СтрокаТаблицы.ФизическоеЛицо);
			КонецЕсли;
		Иначе
			Если СтрокаТаблицы.ВидИзмененияСтроки = -1 Тогда
				РегистрыСведений.ИзмененияФизическихЛицБронированияКомандировок.УдалитьСотрудниковИзСпискаОтправки(
					СтрокаТаблицы.СистемаБронирования, СтрокаТаблицы.ФизическоеЛицо);
			Иначе
				РегистрыСведений.ИзмененияФизическихЛицБронированияКомандировок.ЗарегистрироватьСотрудниковВСпискеОтправки(
					СтрокаТаблицы.СистемаБронирования, СтрокаТаблицы.ФизическоеЛицо);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
